Revit 2027 API
StairsPath.StairsId Property
 The host stairs element id.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkElementId StairsId { get; }
Public ReadOnly Property StairsId As LinkElementId
	Get
public:
property LinkElementId^ StairsId {
	LinkElementId^ get ();
}
member StairsId : LinkElementId with get
Property Value
LinkElementId
See Also
Reference
StairsPath Class
Autodesk.Revit.DB.Architecture Namespace